nimblemachines/muforth/mu/target/ESP8266/esp8266.base.svd
<?xml version="1.0" encoding="UTF-8"?>
<device xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1.0.xsd" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance"
        schemaVersion="1.0">
    <name>esp8266</name>
    <version>1.0</version>
    <addressUnitBits>8</addressUnitBits>
    <width>32</width>
    <cpu>
        <name>Xtensa LX106</name>
        <revision>1</revision>
        <endian>little</endian>
        <mpuPresent>false</mpuPresent>
        <fpuPresent>true</fpuPresent>
        <nvicPrioBits>3</nvicPrioBits>
        <vendorSystickConfig>false</vendorSystickConfig>
    </cpu>
    <peripherals>
        <peripheral>
            <name>DPORT</name>
            <baseAddress>0x3ff00000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x000000a4</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>EDGE_INT_ENABLE</name>
                    <addressOffset>0x4</addressOffset>
                    <description>EDGE_INT_ENABLE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>Register</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DPORT_CTL</name>
                    <addressOffset>0x14</addressOffset>
                    <description>DPORT_CTL</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPORT_CTL_DOUBLE_CLK</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>EFUSE</name>
            <baseAddress>0x3ff00050</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00000080</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>EFUSE_DATA0</name>
                    <addressOffset>0x0</addressOffset>
                    <description>EFUSE_DATA0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>Register</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_DATA1</name>
                    <addressOffset>0x4</addressOffset>
                    <description>EFUSE_DATA1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>Register</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_DATA2</name>
                    <addressOffset>0x8</addressOffset>
                    <description>EFUSE_DATA2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>Register</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EFUSE_DATA3</name>
                    <addressOffset>0xc</addressOffset>
                    <description>EFUSE_DATA3</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>Register</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>GPIO</name>
            <baseAddress>0x60000300</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x000003a0</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>GPIO_OUT</name>
                    <addressOffset>0x0</addressOffset>
                    <description>BT-Coexist Selection register</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_BT_SEL</name>
                            <description>BT-Coexist Selection register</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_OUT_DATA</name>
                            <description>The output value when the GPIO pin is set as output.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_OUT_W1TS</name>
                    <addressOffset>0x4</addressOffset>
                    <description>GPIO_OUT_W1TS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_OUT_DATA_W1TS</name>
                            <description>Writing 1 into a bit in this register will set the related bit in
                                GPIO_OUT_DATA
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_OUT_W1TC</name>
                    <addressOffset>0x8</addressOffset>
                    <description>GPIO_OUT_W1TC</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_OUT_DATA_W1TC</name>
                            <description>Writing 1 into a bit in this register will clear the related bit in
                                GPIO_OUT_DATA
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_ENABLE</name>
                    <addressOffset>0xc</addressOffset>
                    <description>GPIO_ENABLE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_SDIO_SEL</name>
                            <description>SDIO-dis selection register</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_ENABLE_DATA</name>
                            <description>The output enable register.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_ENABLE_W1TS</name>
                    <addressOffset>0x10</addressOffset>
                    <description>GPIO_ENABLE_W1TS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_ENABLE_DATA_W1TS</name>
                            <description>Writing 1 into a bit in this register will set the related bit in
                                GPIO_ENABLE_DATA
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_ENABLE_W1TC</name>
                    <addressOffset>0x14</addressOffset>
                    <description>GPIO_ENABLE_W1TC</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_ENABLE_DATA_W1TC</name>
                            <description>Writing 1 into a bit in this register will clear the related bit in
                                GPIO_ENABLE_DATA
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_IN</name>
                    <addressOffset>0x18</addressOffset>
                    <description>The values of the strapping pins.</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_STRAPPING</name>
                            <description>The values of the strapping pins.</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_IN_DATA</name>
                            <description>The values of the GPIO pins when the GPIO pin is set as input.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_STATUS</name>
                    <addressOffset>0x1c</addressOffset>
                    <description>GPIO_STATUS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_STATUS_INTERRUPT</name>
                            <description>Interrupt enable register.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_STATUS_W1TS</name>
                    <addressOffset>0x20</addressOffset>
                    <description>GPIO_STATUS_W1TS</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_STATUS_INTERRUPT_W1TS</name>
                            <description>Writing 1 into a bit in this register will set the related bit in
                                GPIO_STATUS_INTERRUPT
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_STATUS_W1TC</name>
                    <addressOffset>0x24</addressOffset>
                    <description>GPIO_STATUS_W1TC</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_STATUS_INTERRUPT_W1TC</name>
                            <description>Writing 1 into a bit in this register will clear the related bit in
                                GPIO_STATUS_INTERRUPT
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_PIN0</name>
                    <addressOffset>0x28</addressOffset>
                    <description>GPIO_PIN0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PIN0_WAKEUP_ENABLE</name>
                            <description>0: disable; 1: enable GPIO wakeup CPU, only when GPIO_PIN0_INT_TYPE is 0x4 or
                                0x5
                            </description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN0_INT_TYPE</name>
                            <description>0: disable; 1: positive edge; 2: negative edge; 3: both types of edge; 4:
                                low-level; 5: high-level
                            </description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN0_DRIVER</name>
                            <description>1: open drain; 0: normal</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN0_SOURCE</name>
                            <description>1: sigma-delta; 0: GPIO_DATA</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_PIN1</name>
                    <addressOffset>0x2c</addressOffset>
                    <description>GPIO_PIN1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PIN1_WAKEUP_ENABLE</name>
                            <description>0: disable; 1: enable GPIO wakeup CPU, only when GPIO_PIN0_INT_TYPE is 0x4 or
                                0x5
                            </description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN1_INT_TYPE</name>
                            <description>0: disable; 1: positive edge; 2: negative edge; 3: both types of edge; 4:
                                low-level; 5: high-level
                            </description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN1_DRIVER</name>
                            <description>1: open drain; 0: normal</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN1_SOURCE</name>
                            <description>1: sigma-delta; 0: GPIO_DATA</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_PIN2</name>
                    <addressOffset>0x30</addressOffset>
                    <description>GPIO_PIN2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PIN2_WAKEUP_ENABLE</name>
                            <description>0: disable; 1: enable GPIO wakeup CPU, only when GPIO_PIN0_INT_TYPE is 0x4 or
                                0x5
                            </description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN2_INT_TYPE</name>
                            <description>0: disable; 1: positive edge; 2: negative edge; 3: both types of edge; 4:
                                low-level; 5: high-level
                            </description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN2_DRIVER</name>
                            <description>1: open drain; 0: normal</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN2_SOURCE</name>
                            <description>1: sigma-delta; 0: GPIO_DATA</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_PIN3</name>
                    <addressOffset>0x34</addressOffset>
                    <description>GPIO_PIN3</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PIN3_WAKEUP_ENABLE</name>
                            <description>0: disable; 1: enable GPIO wakeup CPU, only when GPIO_PIN0_INT_TYPE is 0x4 or
                                0x5
                            </description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN3_INT_TYPE</name>
                            <description>0: disable; 1: positive edge; 2: negative edge; 3: both types of edge; 4:
                                low-level; 5: high-level
                            </description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN3_DRIVER</name>
                            <description>1: open drain; 0: normal</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN3_SOURCE</name>
                            <description>1: sigma-delta; 0: GPIO_DATA</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
