nimblemachines/muforth/mu/target/ESP8266/esp8266.base.svd
                <register>
                    <name>GPIO_PIN4</name>
                    <addressOffset>0x38</addressOffset>
                    <description>GPIO_PIN4</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PIN4_WAKEUP_ENABLE</name>
                            <description>0: disable; 1: enable GPIO wakeup CPU, only when GPIO_PIN0_INT_TYPE is 0x4 or
                                0x5
                            </description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN4_INT_TYPE</name>
                            <description>0: disable; 1: positive edge; 2: negative edge; 3: both types of edge; 4:
                                low-level; 5: high-level
                            </description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN4_DRIVER</name>
                            <description>1: open drain; 0: normal</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN4_SOURCE</name>
                            <description>1: sigma-delta; 0: GPIO_DATA</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_PIN5</name>
                    <addressOffset>0x3c</addressOffset>
                    <description>GPIO_PIN5</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PIN5_WAKEUP_ENABLE</name>
                            <description>0: disable; 1: enable GPIO wakeup CPU, only when GPIO_PIN0_INT_TYPE is 0x4 or
                                0x5
                            </description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN5_INT_TYPE</name>
                            <description>0: disable; 1: positive edge; 2: negative edge; 3: both types of edge; 4:
                                low-level; 5: high-level
                            </description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN5_DRIVER</name>
                            <description>1: open drain; 0: normal</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN5_SOURCE</name>
                            <description>1: sigma-delta; 0: GPIO_DATA</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_PIN6</name>
                    <addressOffset>0x40</addressOffset>
                    <description>GPIO_PIN6</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PIN6_WAKEUP_ENABLE</name>
                            <description>0: disable; 1: enable GPIO wakeup CPU, only when GPIO_PIN0_INT_TYPE is 0x4 or
                                0x5
                            </description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN6_INT_TYPE</name>
                            <description>0: disable; 1: positive edge; 2: negative edge; 3: both types of edge; 4:
                                low-level; 5: high-level
                            </description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN6_DRIVER</name>
                            <description>1: open drain; 0: normal</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN6_SOURCE</name>
                            <description>1: sigma-delta; 0: GPIO_DATA</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_PIN7</name>
                    <addressOffset>0x44</addressOffset>
                    <description>GPIO_PIN7</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PIN7_WAKEUP_ENABLE</name>
                            <description>0: disable; 1: enable GPIO wakeup CPU, only when GPIO_PIN0_INT_TYPE is 0x4 or
                                0x5
                            </description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN7_INT_TYPE</name>
                            <description>0: disable; 1: positive edge; 2: negative edge; 3: both types of edge; 4:
                                low-level; 5: high-level
                            </description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN7_DRIVER</name>
                            <description>1: open drain; 0: normal</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN7_SOURCE</name>
                            <description>1: sigma-delta; 0: GPIO_DATA</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_PIN8</name>
                    <addressOffset>0x48</addressOffset>
                    <description>GPIO_PIN8</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PIN8_WAKEUP_ENABLE</name>
                            <description>0: disable; 1: enable GPIO wakeup CPU, only when GPIO_PIN0_INT_TYPE is 0x4 or
                                0x5
                            </description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN8_INT_TYPE</name>
                            <description>0: disable; 1: positive edge; 2: negative edge; 3: both types of edge; 4:
                                low-level; 5: high-level
                            </description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN8_DRIVER</name>
                            <description>1: open drain; 0: normal</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN8_SOURCE</name>
                            <description>1: sigma-delta; 0: GPIO_DATA</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_PIN9</name>
                    <addressOffset>0x4c</addressOffset>
                    <description>GPIO_PIN9</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PIN9_WAKEUP_ENABLE</name>
                            <description>0: disable; 1: enable GPIO wakeup CPU, only when GPIO_PIN0_INT_TYPE is 0x4 or
                                0x5
                            </description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN9_INT_TYPE</name>
                            <description>0: disable; 1: positive edge; 2: negative edge; 3: both types of edge; 4:
                                low-level; 5: high-level
                            </description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN9_DRIVER</name>
                            <description>1: open drain; 0: normal</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN9_SOURCE</name>
                            <description>1: sigma-delta; 0: GPIO_DATA</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_PIN10</name>
                    <addressOffset>0x50</addressOffset>
                    <description>GPIO_PIN10</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PIN10_WAKEUP_ENABLE</name>
                            <description>0: disable; 1: enable GPIO wakeup CPU, only when GPIO_PIN0_INT_TYPE is 0x4 or
                                0x5
                            </description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN10_INT_TYPE</name>
                            <description>0: disable; 1: positive edge; 2: negative edge; 3: both types of edge; 4:
                                low-level; 5: high-level
                            </description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN10_DRIVER</name>
                            <description>1: open drain; 0: normal</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN10_SOURCE</name>
                            <description>1: sigma-delta; 0: GPIO_DATA</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_PIN11</name>
                    <addressOffset>0x54</addressOffset>
                    <description>GPIO_PIN11</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PIN11_WAKEUP_ENABLE</name>
                            <description>0: disable; 1: enable GPIO wakeup CPU, only when GPIO_PIN0_INT_TYPE is 0x4 or
                                0x5
                            </description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN11_INT_TYPE</name>
                            <description>0: disable; 1: positive edge; 2: negative edge; 3: both types of edge; 4:
                                low-level; 5: high-level
                            </description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN11_DRIVER</name>
                            <description>1: open drain; 0: normal</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN11_SOURCE</name>
                            <description>1: sigma-delta; 0: GPIO_DATA</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_PIN12</name>
                    <addressOffset>0x58</addressOffset>
                    <description>GPIO_PIN12</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PIN12_WAKEUP_ENABLE</name>
                            <description>0: disable; 1: enable GPIO wakeup CPU, only when GPIO_PIN0_INT_TYPE is 0x4 or
                                0x5
                            </description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN12_INT_TYPE</name>
                            <description>0: disable; 1: positive edge; 2: negative edge; 3: both types of edge; 4:
                                low-level; 5: high-level
                            </description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN12_DRIVER</name>
                            <description>1: open drain; 0: normal</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN12_SOURCE</name>
                            <description>1: sigma-delta; 0: GPIO_DATA</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_PIN13</name>
                    <addressOffset>0x5c</addressOffset>
                    <description>GPIO_PIN13</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PIN13_WAKEUP_ENABLE</name>
                            <description>0: disable; 1: enable GPIO wakeup CPU, only when GPIO_PIN0_INT_TYPE is 0x4 or
                                0x5
                            </description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN13_INT_TYPE</name>
                            <description>0: disable; 1: positive edge; 2: negative edge; 3: both types of edge; 4:
                                low-level; 5: high-level
                            </description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN13_DRIVER</name>
                            <description>1: open drain; 0: normal</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN13_SOURCE</name>
                            <description>1: sigma-delta; 0: GPIO_DATA</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_PIN14</name>
                    <addressOffset>0x60</addressOffset>
                    <description>GPIO_PIN14</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PIN14_WAKEUP_ENABLE</name>
                            <description>0: disable; 1: enable GPIO wakeup CPU, only when GPIO_PIN0_INT_TYPE is 0x4 or
                                0x5
                            </description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN14_INT_TYPE</name>
                            <description>0: disable; 1: positive edge; 2: negative edge; 3: both types of edge; 4:
                                low-level; 5: high-level
                            </description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN14_DRIVER</name>
                            <description>1: open drain; 0: normal</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN14_SOURCE</name>
                            <description>1: sigma-delta; 0: GPIO_DATA</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
