nimblemachines/muforth/mu/target/ESP8266/esp8266.base.svd
                <register>
                    <name>GPIO_PIN15</name>
                    <addressOffset>0x64</addressOffset>
                    <description>GPIO_PIN15</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>GPIO_PIN15_WAKEUP_ENABLE</name>
                            <description>0: disable; 1: enable GPIO wakeup CPU, only when GPIO_PIN0_INT_TYPE is 0x4 or
                                0x5
                            </description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN15_INT_TYPE</name>
                            <description>0: disable; 1: positive edge; 2: negative edge; 3: both types of edge; 4:
                                low-level; 5: high-level
                            </description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN15_DRIVER</name>
                            <description>1: open drain; 0: normal</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO_PIN15_SOURCE</name>
                            <description>1: sigma-delta; 0: GPIO_DATA</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_SIGMA_DELTA</name>
                    <addressOffset>0x68</addressOffset>
                    <description>GPIO_SIGMA_DELTA</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SIGMA_DELTA_ENABLE</name>
                            <description>1: enable sigma-delta; 0: disable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SIGMA_DELTA_PRESCALAR</name>
                            <description>Clock pre-divider for sigma-delta.</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SIGMA_DELTA_TARGET</name>
                            <description>target level of the sigma-delta. It is a signed byte.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_RTC_CALIB_SYNC</name>
                    <addressOffset>0x6c</addressOffset>
                    <description>Positvie edge of this bit will trigger the RTC-clock-calibration process.</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_CALIB_START</name>
                            <description>Positvie edge of this bit will trigger the RTC-clock-calibration process.
                            </description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTC_PERIOD_NUM</name>
                            <description>The cycle number of RTC-clock during RTC-clock-calibration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GPIO_RTC_CALIB_VALUE</name>
                    <addressOffset>0x70</addressOffset>
                    <description>0: during RTC-clock-calibration; 1: RTC-clock-calibration is done</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_CALIB_RDY</name>
                            <description>0: during RTC-clock-calibration; 1: RTC-clock-calibration is done</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTC_CALIB_RDY_REAL</name>
                            <description>0: during RTC-clock-calibration; 1: RTC-clock-calibration is done</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTC_CALIB_VALUE</name>
                            <description>The cycle number of clk_xtal (crystal clock) for the RTC_PERIOD_NUM cycles of
                                RTC-clock
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
