nimblemachines/muforth/mu/target/ESP8266/esp8266.base.svd
                <register>
                    <name>SPI_PIN</name>
                    <addressOffset>0x2c</addressOffset>
                    <description>1: disable CS2; 0: spi_cs signal is from/to CS2 pin</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>spi_cs2_dis</name>
                            <description>1: disable CS2; 0: spi_cs signal is from/to CS2 pin</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>spi_cs1_dis</name>
                            <description>1: disable CS1; 0: spi_cs signal is from/to CS1 pin</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>spi_cs0_dis</name>
                            <description>1: disable CS0; 0: spi_cs signal is from/to CS0 pin</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_SLAVE</name>
                    <addressOffset>0x30</addressOffset>
                    <description>It is the synchronous reset signal of the module. This bit is self-cleared by
                        hardware.
                    </description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>spi_sync_reset</name>
                            <description>It is the synchronous reset signal of the module. This bit is self-cleared by
                                hardware.
                            </description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>spi_slave_mode</name>
                            <description>1: slave mode, 0: master mode.</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>slv_cmd_define</name>
                            <description>1: slave mode commands are defined in SPI_SLAVE3. 0: slave mode commands are
                                fixed as 1: "write-status"; 4: "read-status"; 2: "write-buffer" and 3: "read-buffer".
                            </description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>spi_trans_cnt</name>
                            <description>The operations counter in both the master mode and the slave mode.
                            </description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>spi_int_en</name>
                            <description>Interrupt enable bits for the below 5 sources</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>spi_trans_done</name>
                            <description>The interrupt raw bit for the completement of any operation in both the master
                                mode and the slave mode.
                            </description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>slv_wr_sta_done</name>
                            <description>The interrupt raw bit for the completement of "write-status" operation in the
                                slave mode.
                            </description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>slv_rd_sta_done</name>
                            <description>The interrupt raw bit for the completement of "read-status" operation in the
                                slave mode.
                            </description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>slv_wr_buf_done</name>
                            <description>The interrupt raw bit for the completement of "write-buffer" operation in the
                                slave mode.
                            </description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>slv_rd_buf_done</name>
                            <description>The interrupt raw bit for the completement of "read-buffer" operation in the
                                slave mode.
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_SLAVE1</name>
                    <addressOffset>0x34</addressOffset>
                    <description>In the slave mode, it is the length in bits for "write-status" and "read-status"
                        operations. The register valueshall be (bit_num-1)
                    </description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>slv_status_bitlen</name>
                            <description>In the slave mode, it is the length in bits for "write-status" and
                                "read-status" operations. The register valueshall be (bit_num-1)
                            </description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>slv_buf_bitlen</name>
                            <description>In the slave mode, it is the length in bits for "write-buffer" and
                                "read-buffer" operations. The register value shallbe (bit_num-1)
                            </description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>9</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>slv_rd_addr_bitlen</name>
                            <description>In the slave mode, it is the address length in bits for "read-buffer"
                                operation. The register value shall be(bit_num-1)
                            </description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>slv_wr_addr_bitlen</name>
                            <description>In the slave mode, it is the address length in bits for "write-buffer"
                                operation. The register value shall be(bit_num-1)
                            </description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>slv_wrsta_dummy_en</name>
                            <description>In the slave mode, it is the enable bit of "dummy" phase for "write-status"
                                operations.
                            </description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>slv_rdsta_dummy_en</name>
                            <description>In the slave mode, it is the enable bit of "dummy" phase for "read-status"
                                operations.
                            </description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>slv_wrbuf_dummy_en</name>
                            <description>In the slave mode, it is the enable bit of "dummy" phase for "write-buffer"
                                operations.
                            </description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>slv_rdbuf_dummy_en</name>
                            <description>In the slave mode, it is the enable bit of "dummy" phase for "read-buffer"
                                operations.
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_SLAVE2</name>
                    <addressOffset>0x38</addressOffset>
                    <description>In the slave mode, it is the length in spi_clk cycles "dummy" phase for "write-buffer"
                        operations. The registervalue shall be (cycle_num-1)
                    </description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>slv_wrbuf_dummy_cyclelen</name>
                            <description>In the slave mode, it is the length in spi_clk cycles "dummy" phase for
                                "write-buffer" operations. The registervalue shall be (cycle_num-1)
                            </description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>slv_rdbuf_dummy_cyclelen</name>
                            <description>In the slave mode, it is the length in spi_clk cycles of "dummy" phase for
                                "read-buffer" operations. The registervalue shall be (cycle_num-1)
                            </description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>slv_wrsta_dummy_cyclelen</name>
                            <description>In the slave mode, it is the length in spi_clk cycles of "dummy" phase for
                                "write-status" operations. Theregister value shall be (cycle_num-1)
                            </description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>slv_rdsta_dummy_cyclelen</name>
                            <description>In the slave mode, it is the length in spi_clk cycles of "dummy" phase for
                                "read-status" operations. Theregister value shall be (cycle_num-1)
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_SLAVE3</name>
                    <addressOffset>0x3c</addressOffset>
                    <description>In slave mode, it is the value of "write-status" command</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>slv_wrsta_cmd_value</name>
                            <description>In slave mode, it is the value of "write-status" command</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>slv_rdsta_cmd_value</name>
                            <description>In slave mode, it is the value of "read-status" command</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>slv_wrbuf_cmd_value</name>
                            <description>In slave mode, it is the value of "write-buffer" command</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>slv_rdbuf_cmd_value</name>
                            <description>In slave mode, it is the value of "read-buffer" command</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_EXT3</name>
                    <addressOffset>0xfc</addressOffset>
                    <description>This register is for two SPI masters to share the same cs, clock and data signals.
                    </description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>reg_int_hold_ena</name>
                            <description>This register is for two SPI masters to share the same cs, clock and data
                                signals.
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_W0</name>
                    <addressOffset>0x40</addressOffset>
                    <description>the data inside the buffer of the SPI module, word 0</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>spi_w0</name>
                            <description>the data inside the buffer of the SPI module, word 0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_W1</name>
                    <addressOffset>0x44</addressOffset>
                    <description>the data inside the buffer of the SPI module, word 1</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>spi_w1</name>
                            <description>the data inside the buffer of the SPI module, word 1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_W2</name>
                    <addressOffset>0x48</addressOffset>
                    <description>the data inside the buffer of the SPI module, word 2</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>spi_w2</name>
                            <description>the data inside the buffer of the SPI module, word 2</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_W3</name>
                    <addressOffset>0x4c</addressOffset>
                    <description>the data inside the buffer of the SPI module, word 3</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>spi_w3</name>
                            <description>the data inside the buffer of the SPI module, word 3</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_W4</name>
                    <addressOffset>0x50</addressOffset>
                    <description>the data inside the buffer of the SPI module, word 4</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>spi_w4</name>
                            <description>the data inside the buffer of the SPI module, word 4</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_W5</name>
                    <addressOffset>0x54</addressOffset>
                    <description>the data inside the buffer of the SPI module, word 5</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>spi_w5</name>
                            <description>the data inside the buffer of the SPI module, word 5</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_W6</name>
                    <addressOffset>0x58</addressOffset>
                    <description>the data inside the buffer of the SPI module, word 6</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>spi_w6</name>
                            <description>the data inside the buffer of the SPI module, word 6</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_W7</name>
                    <addressOffset>0x5c</addressOffset>
                    <description>the data inside the buffer of the SPI module, word 7</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>spi_w7</name>
                            <description>the data inside the buffer of the SPI module, word 7</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
