nimblemachines/muforth/mu/target/ESP8266/esp8266.base.svd
                <register>
                    <name>SPI_W8</name>
                    <addressOffset>0x60</addressOffset>
                    <description>the data inside the buffer of the SPI module, word 8</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>spi_w8</name>
                            <description>the data inside the buffer of the SPI module, word 8</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_W9</name>
                    <addressOffset>0x64</addressOffset>
                    <description>the data inside the buffer of the SPI module, word 9</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>spi_w9</name>
                            <description>the data inside the buffer of the SPI module, word 9</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_W10</name>
                    <addressOffset>0x68</addressOffset>
                    <description>the data inside the buffer of the SPI module, word 10</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>spi_w10</name>
                            <description>the data inside the buffer of the SPI module, word 10</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_W11</name>
                    <addressOffset>0x6c</addressOffset>
                    <description>the data inside the buffer of the SPI module, word 11</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>spi_w11</name>
                            <description>the data inside the buffer of the SPI module, word 11</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_W12</name>
                    <addressOffset>0x70</addressOffset>
                    <description>the data inside the buffer of the SPI module, word 12</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>spi_w12</name>
                            <description>the data inside the buffer of the SPI module, word 12</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_W13</name>
                    <addressOffset>0x74</addressOffset>
                    <description>the data inside the buffer of the SPI module, word 13</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>spi_w13</name>
                            <description>the data inside the buffer of the SPI module, word 13</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_W14</name>
                    <addressOffset>0x78</addressOffset>
                    <description>the data inside the buffer of the SPI module, word 14</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>spi_w14</name>
                            <description>the data inside the buffer of the SPI module, word 14</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SPI_W15</name>
                    <addressOffset>0x7c</addressOffset>
                    <description>the data inside the buffer of the SPI module, word 15</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>spi_w15</name>
                            <description>the data inside the buffer of the SPI module, word 15</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
