nimblemachines/muforth/mu/target/ESP8266/esp8266.base.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>TIMER</name>
            <baseAddress>0x60000600</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00000120</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>FRC1_LOAD</name>
                    <addressOffset>0x0</addressOffset>
                    <description>the load value into the counter</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>frc1_load_value</name>
                            <description>the load value into the counter</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>23</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FRC1_COUNT</name>
                    <addressOffset>0x4</addressOffset>
                    <description>the current value of the counter. It is a decreasingcounter.</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>frc1_count</name>
                            <description>the current value of the counter. It is a decreasingcounter.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>23</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FRC1_CTRL</name>
                    <addressOffset>0x8</addressOffset>
                    <description>FRC1_CTRL</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>frc1_int</name>
                            <description>the status of the interrupt, when the count isdereased to zero</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>frc1_ctrl</name>
                            <description>bit[7]: timer enable, bit[6]: automatically reload, when the counter isequal to
                                zero, bit[3:2]: prescale-divider, 0: divided by 1, 1: dividedby 16, 2 or 3: divided by
                                256, bit[0]: interrupt type, 0:edge, 1:level
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FRC1_INT</name>
                    <addressOffset>0xc</addressOffset>
                    <description>FRC1_INT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>frc1_int_clr_mask</name>
                            <description>write to clear the status of the interrupt, if theinterrupt type is "level"
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FRC2_LOAD</name>
                    <addressOffset>0x20</addressOffset>
                    <description>the load value into the counter</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>frc2_load_value</name>
                            <description>the load value into the counter</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FRC2_COUNT</name>
                    <addressOffset>0x24</addressOffset>
                    <description>the current value of the counter. It is a increasingcounter.</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>frc2_count</name>
                            <description>the current value of the counter. It is a increasingcounter.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FRC2_CTRL</name>
                    <addressOffset>0x28</addressOffset>
                    <description>FRC2_CTRL</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>frc2_int</name>
                            <description>the status of the interrupt, when the count is equal tothe alarm value
                            </description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>frc2_ctrl</name>
                            <description>bit[7]: timer enable, bit[6]: automatically reload, when the counter isequal to
                                zero, bit[3:2]: prescale-divider, 0: divided by 1, 1: dividedby 16, 2 or 3: divided by
                                256, bit[0]: interrupt type, 0:edge, 1:level
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FRC2_INT</name>
                    <addressOffset>0x2c</addressOffset>
                    <description>FRC2_INT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>frc2_int_clr_mask</name>
                            <description>write to clear the status of the interrupt, if theinterrupt type is "level"
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FRC2_ALARM</name>
                    <addressOffset>0x30</addressOffset>
                    <description>the alarm value for the counter</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>frc2_alarm</name>
                            <description>the alarm value for the counter</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
