nimblemachines/muforth/mu/target/ESP8266/esp8266.base.svd
                <register>
                    <name>UART_CONF0</name>
                    <addressOffset>0x20</addressOffset>
                    <description>UART CONFIG0(UART0 and UART1)</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>uart_dtr_inv</name>
                            <description>Set this bit to inverse uart dtr level</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>uart_rts_inv</name>
                            <description>Set this bit to inverse uart rts level</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>uart_txd_inv</name>
                            <description>Set this bit to inverse uart txd level</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>uart_dsr_inv</name>
                            <description>Set this bit to inverse uart dsr level</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>uart_cts_inv</name>
                            <description>Set this bit to inverse uart cts level</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>uart_rxd_inv</name>
                            <description>Set this bit to inverse uart rxd level</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>txfifo_rst</name>
                            <description>Set this bit to reset uart tx fifo</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>rxfifo_rst</name>
                            <description>Set this bit to reset uart rx fifo</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>tx_flow_en</name>
                            <description>Set this bit to enable uart tx hardware flow control</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>uart_loopback</name>
                            <description>Set this bit to enable uart loopback test mode</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>txd_brk</name>
                            <description>RESERVED, DO NOT CHANGE THIS BIT</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>sw_dtr</name>
                            <description>sw dtr</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>sw_rts</name>
                            <description>sw rts</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>stop_bit_num</name>
                            <description>Set stop bit: 1:1bit 2:1.5bits 3:2bits</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>bit_num</name>
                            <description>Set bit num: 0:5bits 1:6bits 2:7bits 3:8bits</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>parity_en</name>
                            <description>Set this bit to enable uart parity check</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>parity</name>
                            <description>Set parity check: 0:even 1:odd, UART CONFIG1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UART_CONF1</name>
                    <addressOffset>0x24</addressOffset>
                    <description>Set this bit to enable rx time-out function</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>rx_tout_en</name>
                            <description>Set this bit to enable rx time-out function</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>rx_tout_thrhd</name>
                            <description>Config bits for rx time-out threshold,uint: byte,0-127</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>7</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>rx_flow_en</name>
                            <description>Set this bit to enable rx hardware flow control</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>rx_flow_thrhd</name>
                            <description>The config bits for rx flow control threshold,0-127</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>7</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>txfifo_empty_thrhd</name>
                            <description>The config bits for tx fifo empty threshold,0-127</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>7</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>rxfifo_full_thrhd</name>
                            <description>The config bits for rx fifo full threshold,0-127</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UART_LOWPULSE</name>
                    <addressOffset>0x28</addressOffset>
                    <description>UART_LOWPULSE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>lowpulse_min_cnt</name>
                            <description>used in baudrate detect</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UART_HIGHPULSE</name>
                    <addressOffset>0x2c</addressOffset>
                    <description>UART_HIGHPULSE</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>highpulse_min_cnt</name>
                            <description>used in baudrate detect</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>20</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UART_RXD_CNT</name>
                    <addressOffset>0x30</addressOffset>
                    <description>UART_RXD_CNT</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>rxd_edge_cnt</name>
                            <description>used in baudrate detect</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UART_DATE</name>
                    <addressOffset>0x78</addressOffset>
                    <description>UART HW INFO</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>uart_date</name>
                            <description>UART HW INFO</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UART_ID</name>
                    <addressOffset>0x7c</addressOffset>
                    <description>UART_ID</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>uart_id</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
