nimblemachines/muforth/mu/target/ESP8266/esp8266.base.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>WDT</name>
            <baseAddress>0x60000900</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0x00000080</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>WDT_CTL</name>
                    <addressOffset>0x0</addressOffset>
                    <description>WDT_CTL</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>Register</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WDT_OP</name>
                    <addressOffset>0x4</addressOffset>
                    <description>WDT_OP</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>Register</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WDT_OP_ND</name>
                    <addressOffset>0x8</addressOffset>
                    <description>WDT_OP_ND</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>Register</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WDT_RST</name>
                    <addressOffset>0x14</addressOffset>
                    <description>WDT_RST</description>
                    <size>32</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>Register</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
    </peripherals>
</device>